

let state = {

	massegPage: {

		userData: [
			{ id: '1', name: 'Катя' },
			{ id: '2', name: 'Руслан' },
			{ id: '3', name: 'Игорь' },
			{ id: '4', name: 'Таня' },
			{ id: '5', name: 'Вика' },
			{ id: '6', name: 'Коля' },
			{ id: '7', name: 'Тарас' },
			{ id: '8', name: 'Ира' },
		],

		massegData: [
			{ id: 1, masseg: 'опа - па...' },
			{ id: 2, masseg: 'опа - па... опа - па... опа - па... ' },
			{ id: 3, masseg: 'опа - па... опа - па... ' },
		],
	},

	profilePage: {
		profilePostsData: [
			{ id: 1, massege: 'Первый пропс переданый мной!', like: '23', name: 'Вася', age: '34' },
			{ id: 1, massege: 'Второй пропс переданый мной!', like: '24', name: 'Олег', age: '43' },
			{ id: 1, massege: 'Третий и ничем не отличающийся от двух предыдущих, пропс переданый мной!', like: '37', name: 'Снижана', age: '23' },
			{ id: 1, massege: 'Четвертый пропс переданый мной!', like: '22', name: 'Виталик', age: '45' },
			{ id: 1, massege: 'Пятый и пожалуй последний. Но тоже такой же самый как и предыдущие четыри пропса. Вообщем на создавал одинаковых пропсов и радуюсь теперь. Какой я молодец...!!!', like: '246', name: 'Андрей', age: '36' },
		],
	},

};

export default state;